"""
Задача:
Дан текстовый файл, содержащий целые числа. Удалить из него все четные числа
"""

def del_ord_number_from_file(filename):
    pass


if __name__ == '__main__':
    filename = "1.txt"
    del_ord_number_from_file(filename)

    print('Done.')